<template>
  <div class="formColor py-5 homePage">
    <div class="container">
      <div id="map" style="height: 650px; width: 100%;"></div>
    </div>
  </div>
</template>

<script>
import L from 'leaflet';

export default {
  data() {
    return {
      map: null, // To store the map instance
      center: [8.641007025172943, 99.8533780487789], // Define the center coordinates
    };
  },
  methods: {
    resetCenter() {
      this.map.setView(this.center); // Reset the map to the defined center
    },
    showContextMenu(e) {
        const { lat, lng } = e.latlng;

        // Create Popup For Right click to coppy lat long
        L.popup()
          .setLatLng(e.latlng)
          .setContent(
            `<div>
              <p>Lat: ${lat.toFixed(6)}, Lng: ${lng.toFixed(6)}</p>
              <button onclick="navigator.clipboard.writeText('${lat}, ${lng}')">Copy Lat/Lng</button>
            </div>`
          )
          .openOn(this.map);
        },
      },
  mounted() {
    // Initialize the map
    this.map = L.map('map').setView(this.center, 14);

    // Add a tile layer
    L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', {
      attribution: '&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors',
    }).addTo(this.map);

    // วาดสามเหลี่ยม
    L.polygon([
      [8.662307229966224, 99.8510992527008], // จุดแรก
      [8.662301926739092, 99.86180663108827], // จุดที่สอง
      [8.660938994888639, 99.8629277944565],
      [8.660196539662607, 99.86208558082582],
      [8.65975636908669, 99.86067473888397],
      [8.659188919512026, 99.86014902591707],
      [8.65943286990135, 99.85883474349977],
      [8.65930559145709, 99.8581051826477],
      [8.659241952218808, 99.85080957412721],
      [8.660175326634608, 99.8510241508484],
      [8.660663225975748, 99.85143184661865],  // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.659061640985236, 99.85072374343872],
      [8.659252558759276, 99.85883474349977], // จุดแรก
      [8.659008608253036, 99.86003637313844],
      [8.656250895878353, 99.85932826995851], // จุดที่สอง
      [8.656484241554272, 99.85831975936891],
      [8.65646302831698, 99.8581910133362],
      [8.656293322375648, 99.8494577407837]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.65605997658136, 99.84930753707887],
      [8.656187256123447, 99.85828757286073], // จุดแรก
      [8.65599633679418, 99.85927462577821],
      [8.654734145458534, 99.85939264297487], // จุดที่สอง
      [8.653631050405345, 99.8590385913849],
      [8.653334062723362, 99.85908150672914],
      [8.653217388927063, 99.84852433204652],
      [8.654935672090192, 99.84870672225954]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.65301586137555, 99.84852433204652],
      [8.653143141946954, 99.85906004905702], // จุดแรก
      [8.652146109652747, 99.85923171043397],
      [8.651530918196688, 99.85956430435182], // จุดที่สอง
      [8.650915725735585, 99.85949993133545],
      [8.650342959437372, 99.85966086387636],
      [8.650247498302965, 99.85583066940309],
      [8.650406600180183, 99.85522985458375],
      [8.650252706183798, 99.85415160655977],
      [8.650311139061921, 99.84883546829225],
      [8.651276355920878, 99.84856724739076]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.650120216752804, 99.84891057014467],
      [8.650194464328962, 99.85196828842165],
      [8.650146733745977, 99.85418915748598], // จุดแรก
      [8.650279318683799, 99.85519230365755],
      [8.650167947339162, 99.85590040683748], // จุดที่สอง
      [8.650141430347489, 99.85972523689271],
      [8.648985287695435, 99.86031532287599],
      [8.647309404890697, 99.86046552658082],
      [8.647404866769683, 99.85795497894289],
      [8.647288191136525, 99.85726833343507],
      [8.647192729227973, 99.84873890876771],
      [8.648285236291317, 99.84865307807922],
      [8.649536842430841, 99.8490607738495]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.647044232877695, 99.84872817993165],
      [8.647160908586411, 99.85730051994325],
      [8.647277584258994, 99.85799789428712], // จุดแรก
      [8.647139694823867, 99.86058354377748],
      [8.64550623152199, 99.86024022102357], // จุดที่สอง
      [8.644095507517529, 99.86020803451538],
      [8.644190970210724, 99.84867453575134]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.64405307964612, 99.84870672225954],
      [8.643947009946707, 99.86020803451538],
      [8.64115736613682, 99.86025094985963], // จุดแรก
      [8.64119979433416, 99.84797716140747],
      [8.642462031020726, 99.84812736511232], // จุดที่สอง
      [8.64322573519907, 99.84849214553834]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.641030081516178, 99.84792351722717],
      [8.640977046244888, 99.86027240753175],
      [8.638081309110023, 99.86032605171205], // จุดแรก
      [8.63798584486983, 99.85413551330568],
      [8.638187380459673, 99.84726905822754], // จุดที่สอง
      [8.638171469759127, 99.84721004962923],
      [8.638972307519897, 99.84743535518646]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.63801766628592, 99.84726905822754],
      [8.63782673774915, 99.85419988632202],
      [8.637879773463503, 99.86030459403993], // จุดแรก
      [8.6350582631059, 99.86041188240053],
      [8.634984012548355, 99.8475694656372], // จุดที่สอง
      [8.63594926865659, 99.8471510410309],
      [8.63712666562079, 99.84742999076845]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.634803689704919, 99.84760165214539],
      [8.634877940297946, 99.86043334007265],
      [8.632257946248773, 99.86090540885925], // จุดแรก
      [8.632024585572697, 99.85958576202394],
      [8.632035192879284, 99.85171079635622], // จุดที่สอง
      [8.631748795496776, 99.85092222690582],
      [8.63198215634337, 99.84887838363649],
      [8.632576165119977, 99.84736025333406]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.632459484898348, 99.847349524498],
      [8.631860172282465, 99.8488301038742],
      [8.631616204042379, 99.8509705066681], // จุดแรก
      [8.631945030763779, 99.8518180847168],
      [8.631929119799985, 99.85959649086], // จุดที่สอง
      [8.632162480535094, 99.86095905303956],
      [8.628640839557345, 99.86144185066225],
      [8.628693876562696, 99.86022949218751],
      [8.629372749573314, 99.85236525535585],
      [8.628990883655046, 99.84833121299744],
      [8.631812439378336, 99.84733879566194]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.628874202325209, 99.8483580350876],
      [8.629224246206554, 99.8530250787735],
      [8.628471121090124, 99.86135601997377], // จุดแรก
      [8.627076244547837, 99.8616135120392],
      [8.62590942371084, 99.85915124416353], // จุดที่สอง
      [8.626068535855422, 99.85793352127077],
      [8.626073839592422, 99.84972596168518],
      [8.627420986377954, 99.84944164752962],
      [8.627723298185348, 99.84933972358704]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");

    L.polygon([
      [8.625951853622613, 99.84966158866882],
      [8.625978372315053, 99.85789597034454],
      [8.62577152646464, 99.85912978649141], // จุดแรก
      [8.626970170075252, 99.86163496971132],
      [8.622679432685935, 99.86229479312898], // จุดที่สอง
      [8.622679432685935, 99.86204266548158],
      [8.622774900797003, 99.86171007156373],
      [8.623416658028654, 99.86052989959717],
      [8.62345908822043, 99.86025631427766],
      [8.623406050479963, 99.85937654972078],
      [8.623050697426825, 99.85742926597597],
      [8.623448480672922, 99.85483288764955],
      [8.622785508363416, 99.85392093658447],
      [8.623618201397129, 99.85246181488037],
      [8.62337422783212, 99.8493129014969],
      [8.623517429726332, 99.84913587570192],
      [8.62477972555689, 99.84926998615266],
      [8.625623021681657, 99.84946310520174]
       // จุดที่สาม
    ], {
      color: 'blue',
      fillColor: '#3388ff',
      fillOpacity: 0.5,
    }).addTo(this.map).bindPopup("นี่คือสามเหลี่ยม");
    // วาดสี่เหลี่ยม


    const roundedRectangleCoords = [
      [51.505, -0.09],   // จุดเริ่มต้น
      [51.505, -0.07],   // ด้านบน
      [51.503, -0.065],  // โค้งด้านขวา
      [51.501, -0.07],   // ด้านล่าง
      [51.501, -0.08],   // ด้านซ้าย
      [51.503, -0.095],  // โค้งด้านซ้าย
      [51.505, -0.09],   // กลับมาที่จุดเริ่มต้น
    ];

    // เพิ่มเส้น Polyline
    L.polyline(roundedRectangleCoords, {
      color: 'green',
      weight: 4,
      smoothFactor: 1, // ใช้ smoothFactor เพื่อทำให้เส้นโค้งนุ่มนวลขึ้น
    }).addTo(this.map).bindPopup("สี่เหลี่ยมโค้งมน");

 
    // Right click to coppy lat long
    this.map.on('contextmenu', this.showContextMenu);

  },
};
</script>

<style>
/* Ensure the map container has a height */
.homePage { /* หรือ .container ถ้าคุณต้องการปรับ container ด้านใน */
  margin-left: 70px; /* ค่า margin-left เริ่มต้น: เท่ากับความกว้าง Sidebar ตอนย่อ */
  transition: margin-left 0.3s ease; /* เพิ่ม transition เพื่อความสวยงาม */
  /* padding: 20px;  อาจเพิ่ม padding เพื่อให้เนื้อหาไม่ชิดขอบซ้ายเกินไป ถ้าจำเป็น */
}

.sidebar.expanded + .homePage { /* ปรับแก้ selector ให้ตรงกับโครงสร้าง HTML จริงของคุณ */
  margin-left: 15%; /* ค่า margin-left เมื่อ Sidebar ขยาย: เท่ากับความกว้าง Sidebar ตอนขยาย */
}
</style>
